# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'
tap 'cloudflare/cloudflare'
tap 'shopify/shopify'
tap 'romkatv/powerlevel10k'
tap 'oven-sh/bun'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'wrk'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'python@3.10'
brew 'pyenv'
brew 'caddy'
brew 'pipenv'
brew 'awscli'
brew 'nvm'
brew 'mailpit'

# Apps
cask 'raycast'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'imageoptim'
cask 'phpmon'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'warp'
cask 'royal-tsx'
cask 'postman'
cask 'transmission'
cask 'anydesk'
cask 'stats'
cask 'rectangle'
cask 'fig'
cask 'shottr'
cask 'firefox'
cask 'appcleaner'
cask 'obsidian'
cask 'figma'
cask 'notion'
cask 'vlc'
cask 'teamspeak-client'
cask 'discord'
cask 'zed'
cask 'sublime-text'
cask 'orbstack'
cask 'shottr'
cask 'mac-mouse-fix'
cask 'cloudflare-warp'

# Quicklook
cask 'quicklook-json'
